{"projects":[{"title":"Counting Peak Bloom","url":"https://www.hrecht.com/cherry-blossoms/","outlet":"Personal project","image":{"src":"assets/2024-cherry-blossoms.png","alt":"Interactive map screenshot showing cherry blossom tree locations near a point in the District of Columbia."},"description":[{"type":"text","value":"The beauty of D.C.’s cherry blossoms isn’t in the festival, the parade or the hordes of tourists who descend upon the National Mall. I mapped cherry blossom trees across the District to count how many are near any address. Click on your home to find how many you can reach in a half mile radius, or about a ten minute walk."},{"type":"text","value":"I built this project with 100% open-source software including MapLibre, Turf, Protomaps, and D.C.’s address API."}],"highlight":[{"type":"text","value":"Honorable mention in the <a href=\"https://pudding.cool/pudding-cup/\" target=\"_blank\">2024 Pudding Cup</a>."}]},{"title":"Tracking Census Dataset Changes","url":"https://www.hrecht.com/census-api-datasets/","outlet":"Personal project","image":{"src":"assets/2025-census-api-datasets.png","alt":"Table showing datasets newly added to the Census Bureau APIs"},"description":[{"type":"text","value":"The Census Bureau doesn’t maintain a public changelog or regularly share updates about changes to their sprawling API universe. As a longtime Census data user and package developer I’ve found it nearly impossible to know when data is added or removed. This project publicly catalogs the changes."},{"type":"text","value":"The tracker code is written in R, using my <a href=\"https://www.hrecht.com/censusapi/\" target=\"_blank\">censusapi package</a> to grab dataset info, and runs on a schedule using Github Actions. Major updates are automatically posted on <a href=\"https://bsky.app/profile/censusapitracker.bsky.social\" target=\"_blank\">Bluesky</a>. The dashboard is built with Svelte."}]},{"title":"Which States Mandate Fluoride in Drinking Water","url":"https://www.washingtonpost.com/health/interactive/2024/fluoride-water-mandates/","outlet":"The Washington Post","image":{"src":"assets/2024-fluoride.png","alt":"A U.S. map showing the percent of people who have unfluoridated drinking water, naturally fluoridated water, and water with added fluoride by state using data from the CDC. The lowest fluoridation rates are in Hawaii, New Jersey, and Oregon."},"description":[{"type":"text","value":"RFK Jr. wants fluoride out of water but about a dozen states require it. I dug in to how the incoming Trump administration could defluoridate drinking water even though most water treatment decisions are left to local agencies. I gathered and analyzed data from the CDC, mapped fluoridation rates, and examined state laws."}]},{"title":"The Powerful Constraints on Medical Care in Catholic Hospitals Across America","url":"https://kffhealthnews.org/news/article/catholic-hospitals-affiliates-ethical-religious-directives-reproductive-care/","outlet":"KFF Health News","image":{"src":"assets/2024-catholic-hospitals.png","alt":"US map with title: Where Catholic Hospitals Dominate. Subtitle: Where Catholic Hospitals Dominate. The map shows that most of the midwest, northeast, west coast, and parts of the south have Catholic hospitals nearby."},"description":[{"type":"text","value":"I compiled detailed birth data from every state and tracked the affiliation of every hospital in the U.S. to find that 16% of births are in Catholic hospitals, which restrict reproductive and contraceptive care. My spatial analysis revealed that three out of four Americans live within an hour's drive of Catholic birthing hospitals."},{"type":"text","value":"Our investigation found that many don’t have a choice for their care — non-Catholic hospitals are too far to reach in an emergency or aren’t in their insurance networks. Ambulances may take patients to a Catholic facility without giving them a say. Women often don’t know that hospitals are affiliated with the Catholic Church or that they restrict reproductive care."}],"highlight":[{"type":"text","value":"Second place in the <a href=\"https://www.headlinerawards.org/2025-online/\" target=\"_blank\">2025 National Headliner Awards, online beat reporting health and science</a>. Finalist for the 2025 NIHCM Award, data-driven storytelling</a>."}]},{"title":"2024 Election Coverage","outlet":"The Washington Post","image":{"src":"assets/2024-senate-races.png","alt":"Chart showing Senate seats by party before the 2024 election and how many were up for election"},"description":[{"type":"text","value":"I covered the 2024 U.S. elections with The Washington Post graphics team."}],"urls":[{"title":"The districts that will determine majority control of the House","url":"https://www.washingtonpost.com/elections/interactive/2024/us-house-races-to-watch/"},{"title":"The 9 races and 3 long shots that could determine Senate control","url":"https://www.washingtonpost.com/elections/2024/2024-us-senate-races-to-watch/"},{"title":"More than 84 million Americans cast a ballot before Election Day","url":"https://www.washingtonpost.com/elections/2024/10/24/early-voting-turnout/"}]},{"title":"Underfunded and Under Threat","url":"https://kffhealthnews.org/news/tag/underfunded-and-under-threat/","outlet":"KFF Health News","image":{"src":"assets/2021-underfunded.png","alt":"US map showing locations of public health department leaders who exited their jobs during the first year of the pandemic"},"description":[{"type":"text","value":"This year-long collaboration between KFF Health News and The Associated Press examined how the U.S. public health front lines have been left understaffed and ill-prepared to save us from the coronavirus pandemic."},{"type":"text","value":"As the project’s data reporter, I set up a Google sheets system to organize public records requests and reporter-collected information on public health leaders who had exited. I analyzed data from scanned PDFs, government reports, and research organizations. We <a href=\"https://kffhealthnews.org/news/get-the-data-hollowed-out-public-health-system-faces-more-cuts-amid-virus/\" target=\"_blank\">published the underlying data</a> on <a href=\"https://data.world/associatedpress/public-health-official-departures\" target=\"_blank\">Data.World</a> and <a href=\"https://github.com/khnews/2020-underfunded-under-threat-data\" target=\"_blank\">Github</a> and helped local reporters adapt our findings through webinars and direct guidance."}],"urls":[{"title":"Hollowed-Out Public Health System Faces More Cuts Amid Virus","url":"https://kffhealthnews.org/news/us-public-health-system-underfunded-under-threat-faces-more-cuts-amid-covid-pandemic/"},{"title":"Politics Slows Flow of US Pandemic Relief Funds to Public Health Agencies","url":"https://kffhealthnews.org/news/politics-slows-flow-of-us-pandemic-relief-funds-to-public-health-agencies/"},{"title":"Florida’s Cautionary Tale: How Gutting and Muzzling Public Health Fueled COVID Fire","url":"https://kffhealthnews.org/news/floridas-cautionary-tale-how-starving-and-muzzling-public-health-fueled-covid-fire/"},{"title":"Public Health Experts Worry About Boom-Bust Cycle of Support","url":"https://kffhealthnews.org/news/article/public-health-experts-worry-about-boom-bust-cycle-of-support/"}],"highlight":[{"type":"text","value":"Winner of the <a href=\"https://awards.journalists.org/entries/underfunded-and-under-threat/\" target=\"_blank\">2021 Online Journalism Awards University of Florida Award for Investigative Data Journalism</a> and the <a href=\"https://sjawards.aaas.org/awards/field_award_year/2020-88\" target=\"_blank\">2020 AAAS Kavli award, science reporting</a>. Finalist for the <a href=\"https://nihcm.org/awards/general-circulation-journalism/finalists\" target=\"_blank\">2021 NIHCM Award, general circulation</a> and <a href=\"https://sabew.org/2020-best-in-business-awards-honorees/\" target=\"_blank\">2020 SABEW Award, government</a>."}]},{"title":"As Medicaid Purge Begins, ‘Staggering Numbers’ of Americans Lose Coverage","url":"https://kffhealthnews.org/news/article/medicaid-unwinding-state-data-coverage-loss/","outlet":"KFF Health News","image":{"src":"assets/2023-medicaid.png","alt":"Part of a chart showing state-by-state rates of Medicaid coverage renewals and terminations in the early weeks of the Medicaid unwinding."},"description":[{"type":"text","value":"In the early days of the Medicaid “unwinding”, I requested data from every state that had begun to roll back pandemic-era Medicaid eligbility protections. My analysis found that the overwhelming majority of people who had lost coverage so far were dropped because of technicalities, not because officials determined they are no longer eligible."},{"type":"text","value":"I <a href=\"https://www.documentcloud.org/documents/23830583-2023-06-01-kff-health-news-medicaid-unwinding-data\" target=\"_blank\">published</a> all of the underlying records for reuse by local reporters and researchers."}]},{"title":"Covid Vaccination Disparities","outlet":"KFF Health News","image":{"src":"assets/2021-vaccination-disparities.png","alt":"Chart showing share of vaccinated people who are Black vs share of state residents who are Black for several states in January 2021. In every state, the share of vaccinated people who are Black was far lower than the share of state residents."},"description":[{"type":"text","value":"We published one of the first national analyses revealing deep racial disparities in the covid vaccine rollout. We later obtained exclusive federal data on vaccinations by race and ethnicity for every state and also analyzed vaccination rates of children."}],"urls":[{"title":"Black Americans Are Getting Vaccinated at Lower Rates Than White Americans","url":"https://kffhealthnews.org/news/article/black-americans-are-getting-vaccinated-at-lower-rates-than-white-americans/"},{"title":"As Vaccine Rollout Expands, Black Americans Still Left Behind","url":"https://kffhealthnews.org/news/article/as-vaccine-rollout-expands-black-americans-still-left-behind/"},{"title":"Stark Racial Disparities Persist in Vaccinations, State-Level CDC Data Shows","url":"https://kffhealthnews.org/news/article/covid-vaccination-stark-racial-disparities-persist-state-level-cdc-data/"},{"title":"As Omicron Surges, Effort to Vaccinate Young Children Stalls","url":"https://kffhealthnews.org/news/article/as-omicron-surges-effort-to-vaccinate-young-children-stalls/"}],"highlight":[{"type":"text","value":"Finalist for the <a href=\"https://nihcm.org/awards/general-circulation-journalism/finalists\" target=\"_blank\">2022 NIHCM Award, general circulation</a>."}]},{"title":"Inaccessible Health Care","outlet":"KFF Health News","image":{"src":"assets/2021-inacessible-vaccine-websites.png","alt":"Screenshot of top of news article displaying the headline Covid Vaccine Websites Violate Disability Laws, Create Inequity for the Blind, followed by a picture of a blind man posing for a portrait outdoors and holding his white cane"},"description":[{"type":"text","value":"Our investigation found covid vaccine registration and information websites at the federal, state and local levels were flouting disability rights laws and limiting the ability of people who are blind or visually impaired to sign up for shots."},{"type":"text","value":"Five New York state and local government agencies agreed to fix covid-19 vaccine websites to make them accessible for blind users following a Department of Justice investigation spurred by our initial story."}],"urls":[{"title":"Covid Vaccine Websites Violate Disability Laws, Create Inequity for the Blind","url":"https://kffhealthnews.org/news/article/covid-vaccine-websites-violate-disability-laws-create-inequity-for-the-blind/"},{"title":"NY Reaches Agreement With DOJ Over Vaccine Access for Blind People","url":"https://kffhealthnews.org/news/article/ny-reaches-agreement-with-doj-over-vaccine-access-for-blind-people/"},{"title":"The Disability Tax: Medical Bills Remain Inaccessible for Many Blind Americans","url":"https://kffhealthnews.org/news/article/disability-tax-medical-bills-inaccessible-blind-americans/"}],"highlight":[{"type":"text","value":"Winner of the 2023 Great Plains Journalism Award for General News, single story."}]},{"title":"Covid Treatment Rollout","outlet":"KFF Health News","image":{"src":"assets/2022-test-to-treat.png","alt":"Bar chart with title CVS MinuteClinics Dominate Covid Test-to-Treat program, showing number of participating locations by type. CVS had 1,193, far dwarfing every other group."},"description":[{"type":"text","value":"I investigated how well the US’s covid treatment strategy served the most vulnerable patients and explained how HHS’s lack of transparency made it difficult for people to get potentially-lifesaving medication."}],"urls":[{"title":"How the Test-to-Treat Pillar of the US Covid Strategy Is Failing Patients","url":"https://kffhealthnews.org/news/article/test-to-treat-biden-covid-failing-patients-pharmacies-cvs/"},{"title":"Is Paxlovid, the Covid Pill, Reaching Those Who Most Need It? The Government Won’t Say","url":"https://kffhealthnews.org/news/article/paxlovid-covid-pill-antiviral-access-data/"},{"title":"It Was Already Hard to Find Evusheld, a Covid Prevention Therapy. Now It’s Even Harder.","url":"https://kffhealthnews.org/news/article/evusheld-covid-prevention-monoclonal-antibody-therapy-availability-hhs/"},{"title":"Biden Administration’s Rapid-Test Rollout Doesn’t Easily Reach Those Who Need It Most","url":"https://kffhealthnews.org/news/article/biden-administrations-rapid-test-rollout-doesnt-easily-reach-those-who-need-it-most/"}]},{"title":"In Appalachia and the Mississippi Delta, Millions Face Long Drives to Stroke Care","url":"https://kffhealthnews.org/news/article/appalachia-mississippi-delta-stroke-treatment-advanced-care-rural-access/","outlet":"KFF Health News","image":{"src":"assets/2021-rural-stroke.png","alt":"Map of southeastern US showing that many parts of the region have no stroke-certified hospitals within a 45-minute drive."},"description":[{"type":"text","value":"In several Mississippi Delta and Appalachian states, more than half of residents must drive longer than 45 minutes to reach a hospital that is stroke-certified and able to provide the most advanced care."},{"type":"text","value":"I analyzed drive times to stroke-certified hospitals using R and published the code behind this analysis <a href=\"https://github.com/khnews/2021-delta-appalachia-stroke-access\" target=\"_blank\">on Github</a>."}]},{"title":"What Life Would Look Like Without the ‘Tampon Tax’","url":"https://www.bloomberg.com/graphics/2018-tampon-cost/","outlet":"Bloomberg News","image":{"src":"assets/2018-tampon-cost.gif","alt":"Pile of over-the-counter health projects on left and single tampon on right in front of teal background"},"description":[{"type":"text","value":"“Band-aids—check. Condoms—check. Sunscreen—check. Tampons? Nope, sorry.”"},{"type":"text","value":"I explored how the omission of menstrual products from the U.S.’s list of medical products eligible for tax breaks disproportionately affected low-income women and girls."}],"highlight":[{"type":"text","value":"Winner of the 2019 Malofiej Award for Equality and Women’s Promotion Best Graphic, digital."}]},{"title":"Colorado’s Ski Towns Could Fix the High Cost of American Health Care","url":"https://www.bloomberg.com/graphics/2019-colorado-new-healthcare-cost-plan/","outlet":"Bloomberg News","image":{"src":"assets/2019-colorado-new-healthcare-cost-plan.png","alt":"Map of Colorado showing number of hospitals in one hour driving time"},"description":[{"type":"text","value":"We examined the high prices and long drives to hospitals that led rural Coloradans to create an innovative insurance pricing model."}]},{"title":"Where Democratic Candidates Disagree in Congress—If They Vote at All","url":"https://www.bloomberg.com/graphics/2019-democratic-presidential-candidates-voting-record/","outlet":"Bloomberg News","image":{"src":"assets/2019-democratic-presidential-candidates-voting-record.png","alt":"Democratic presidential candidate faces on background of colorful red, orange and yellow circles"},"description":[{"type":"text","value":"Ahead of the 2020 Democratic primary, I analyzed Congressional voting records of the presidential candidates to find out how often they skipped votes and who disagreed with each other the most."}]},{"title":"Orphan Black: Clone Tracker","url":"https://www.hrecht.com/orphanblack-update/","outlet":"Personal project","image":{"src":"assets/orphan-black-tracker.png","alt":"Orphan Black clone character chart and photograph"},"description":[{"type":"text","value":"Orphan Black was a science fiction show about clones starring Tatiana Maslany opposite herself in several lead roles. Some reviewers claimed she must be in every minute of the show. I had to investigate."},{"type":"text","value":"In the end, there were 50 episodes and 2,062 minutes of Orphan Black, featuring 1,982 minutes of Maslany."}]},{"title":"Here’s How Affordable Care Act Marketplaces Are Shaping Up Under Trump’s Watch","url":"https://www.bloomberg.com/graphics/health-insurance-marketplaces-for-2018/","outlet":"Bloomberg News","image":{"src":"assets/health-insurance-marketplaces-for-2018.gif","alt":"Animated US county map showing counties gaining and losing insurance offerings by month"},"description":[{"type":"text","value":"As Republicans attempted to repeal the Affordable Care Act in 2017, health insurance companies began to retreat from the ACA marketplaces. I tracked the proposed 2018 ACA marketplace offerings of every company in every county for several months by analyzing arcane insurance rate filings in this blog-style project."}]},{"title":"#MeToo’s First Year Ends With More Than 425 Accused","url":"https://www.bloomberg.com/graphics/2018-me-too-anniversary/","outlet":"Bloomberg News","image":{"src":"assets/2018-me-too-anniversary.png","alt":"Overlapping headlines from hundreds of me too stories with the title '#MeToo: One Year Later' in the center"},"description":[{"type":"text","value":"We assembled a database of hundreds of people publicly accused of sexual misconduct in the first year after accusations against Harvey Weinstein became public. For the page header, I created a dizzying animation of the year’s worth of headlines to reflect the quickly growing #MeToo movement."}]},{"title":"The Massive Prize Luring Miners to the Stars","url":"https://www.bloomberg.com/graphics/2018-asteroid-mining/","outlet":"Bloomberg News","image":{"src":"assets/2018-asteroid-mining.png","alt":"Illustration of spacecraft on starry background"},"description":[{"type":"text","value":"Asteroids hold potential riches — if miners can reach them. I created illustrations of the first U.S. spacecraft set to bring an asteroid sample back to Earth and analyzed the estimated quintillions of dollars hidden in some distant asteroids."}]},{"title":"Track the Key Changes in the GOP’s Health Plan","url":"https://www.bloomberg.com/graphics/2017-healthcare-bill-changes/","outlet":"Bloomberg News","image":{"src":"assets/2017-healthcare-bill-changes.png","alt":"Text on light blue background listing key events in 2017 attempted Affordable Care Act repeal"},"description":[{"type":"text","value":"We tracked the many Republican attempts to repeal the Affordable Care Act throughout 2017, quickly analyzing what each new plan would change and how that would impact Americans."}]}]}